python, numpy, pandas 날짜 타입 비교 및 정리

- datetime은 python 설치 시 기본적으로 내장된 라이브러리로, 날짜를 쓸 것인지, 시간을 쓸 것인지, 날짜시간을 합쳐쓸 것인지에 따라 클래스가 분화되어 있는 것이 특징. 예를들어 '2021-3-16'을 표시하고 싶으면 date 클래스를 사용하고, '2021-3-16 12:34:21'를 표시하고 싶으면 'datetime' 클래스를 사용합니다. 
- 반면 datetime64나 Timestamp는 각각 numpy, pandas 라이브러리에서 새로 정의한 날짜시간 클래스입니다. 이 둘은 numpy, pandas를 설치해야만 이용할 수 있고, 한 클래스로 날짜, 시간, 날짜시간을 모두 정의할 수 있는 것이 특징
- 날짜, 시간 타입은 일반적인 정수, 실수끼리 연산할 때와 달리 단위를 가지고 있는 점 때문에 시간의 차이를 저장하는 별도의 클래스가 있다는 특징. 이를 timedelta(타임델타)라고 하는데, 날짜, 시간은 특정 시점의 시각을 표시하는 용도이고(2021년 3월 16일), 타임델타는 기간 또는 시간 차이를 표시하는 용도(5일)

- https://ellun.tistory.com/320

<img src='dataset/날짜타입.jpg' STYLE='width:500px;'>

In [1]:
# 날짜는 자주 잊어버리니 많은 반복학습이 필요
# 날짜 : date
# 날짜+시간 : datetime

#### 파이썬 날짜, 시간

- timestamp -> str 문자  타입변환 중요!

In [3]:
import time

t = time.time()  # 1970년 1월1일부터 지난 초
print(t,type(t))
s = str(time.time())
print(s, type(s))

1656550149.9340792 <class 'float'>
1656550149.9340792 <class 'str'>

- datetime -> str

In [15]:
from datetime import datetime
s = datetime.now()
print(s,type(s))
sl = s.strftime('%Y-%m-%d %H:%M:%S')  # 날짜와 시간. Y : year.
print(sl, type(sl))

2022-06-30 10:22:41.177360 <class 'datetime.datetime'>
2022-06-30 10:22:41 <class 'str'>

- str -> datetime

In [12]:
from datetime import datetime
s = '2021-07-20 11:13:58'
print(s,type(s))

d = datetime.strptime(s,'%Y-%m-%d %H:%M:%S') # p: passing strptime : str을 time으로 바꿔줌
print(d, type(d))

2021-07-20 11:13:58 <class 'str'>
2021-07-20 11:13:58 <class 'datetime.datetime'>

- str -> datetime -> timestamp

In [14]:
s = '2021-07-20 11:13:58'
timestamp = time.mktime(datetime.strptime(s,'%Y-%m-%d %H:%M:%S').timetuple()) 
# mktime : 지방표준시인 struct_time 시퀀스 객체를 인자로 받아서 time()과
        # 같은 누적된 초를 반환
print(timestamp, type(timestamp))

1626747238.0 <class 'float'>

-  datetime -> timestamp

In [25]:
d = datetime.today()
print(d,type(d))
timestamp1 = time.mktime(d.timetuple())  #mktime은 datetime을 timestamp로 바꿔줌
print(timestamp1, type(timestamp1))

2022-06-30 10:26:34.120676 <class 'datetime.datetime'>
1656552394.0 <class 'float'>

- timestamp -> datetime

In [30]:
t = time.time() #70년부터 지금까지의 초
print(t, type(t))
d = datetime.fromtimestamp(t)  #fromtimestamp : ?
print(d, type(d))

1656552469.1618903 <class 'float'>
2022-06-30 10:27:49.161890 <class 'datetime.datetime'>

#### 과제(6/30)
- 현재시간을 timestamp으로 불러와서 datetime, str로 타입을 변경한 후 다시 timestamp으로 변경하세요.
- 원하는 날짜+시간을 5개 str로 만든 후 datetime, timestamp 타입으로 변경하세요.

In [2]:
# 1-1. timestamp -> datetime
import time
from datetime import datetime

t = time.time()
d = datetime.fromtimestamp(t)
print(d)

2022-06-30 16:44:07.384871

In [10]:
# 1-2. datetime -> timestamp
d = datetime.now() # = datetime.today()
ttimestamp = time.mktime(d.timetuple())
print(ttimestamp)

1656575252.0

In [19]:
# 1-3. timestamp -> str
import time
from datetime import datetime
t = datetime.now()

tl = t.strftime('%Y-%m-%d %H:%M:%S')   # 연월일은 연만 대문자, 시간은 전부 대문자
tl

'2022-06-30 16:52:35'

In [23]:
# 1-4. str -> timestamp
from datetime import datetime
d1 = '2022-09-20 2:3:5'
d2 = datetime.strptime(d1, '%Y-%m-%d %H:%M:%S')
d2

datetime.datetime(2022, 9, 20, 2, 3, 5)

In [32]:
# 2. 원하는 날짜+시간을 5개 str로 만든 후 datetime, timestamp 타입으로 변경하세요.

In [44]:
# 2-1. str -> datetime -> timestamp 차례대로
from datetime import datetime
grave = '2052-07-06 12:00:00'
tomb = datetime.strptime(grave,'%Y-%m-%d %H:%M:%S')
print(tomb) # str -> datetime

dust = time.mktime(tomb.timetuple()) # datetime -> timestamp

# timestamp = time.mktime(datetime값.timetuple())

2052-07-06 12:00:00

In [36]:
# 2-2. str -> timestamp
from datetime import datetime
worldcup = '2002-05-20 14:32:44'

change = time.mktime(datetime.strptime(worldcup,'%Y-%m-%d %H:%M:%S').timetuple())
change

1021872764.0

In [50]:
# 2-3. str -> timestamp
from datetime import datetime
abcd = '1995-8-15 12:12:34'  # 1970년부터 설정!!

free = time.mktime(datetime.strptime(abcd,'%Y-%m-%d %H:%M:%S').timetuple())
free

808456354.0

In [54]:
# 2-4. str -> datetime -> timestamp
from datetime import datetime
a = '1989-7-30 19:5:13'

wasday = datetime.strptime(a,'%Y-%m-%d %H:%M:%S')
print(wasday)  # str -> datetime
past = time.mktime(wasday.timetuple())  # datetime -> timestamp
print(past)

1989-07-30 19:05:13
617796313.0

In [57]:
# 2-5. str -> timestamp
from datetime import datetime
doomsday = '1992-3-23 4:49:11'

fate = datetime.strptime(doomsday, '%Y-%m-%d %H:%M:%S')
fate

datetime.datetime(1992, 3, 23, 4, 49, 11)

In [40]:
from datetime import timedelta
import time

In [42]:
datetime_now = datetime.now()
print(datetime_now)
delta_datetime = timedelta(days= -365)  # 복합대비연산자 x += i
print(delta_datetime)                  # -=와 =- 차이?

datetime_now + delta_datetime

2022-06-30 10:38:06.367821
-365 days, 0:00:00

datetime.datetime(2021, 6, 30, 10, 38, 6, 367821)

- 두 날짜간의 일수 구하기

In [44]:
since_timestamp = datetime.strptime('20180301', '%Y%m%d')  # 형식을 맞춰줘야 정확히 인식함
until_timestamp = datetime.strptime('20180331', '%Y%m%d')
print(since_timestamp)
print(until_timestamp)
result = until_timestamp - since_timestamp
result

2018-03-01 00:00:00
2018-03-31 00:00:00

datetime.timedelta(days=30)

- 특정요일 구하기

In [46]:
import datetime
def get_yoil(y,m,d) :
    days = ['MON','TUE',"WED","THU","FRI","SAT","SUN"]
    return days[datetime.date(y,m,d).weekday()]  # 날짜 인자값 받은것에 상응하는 요일 출력

get_yoil(2022,6,30)

'THU'

- 판다스 to_datetime
 (판다스에서는 파이썬의 datetime을 timestamp라고 부른다. 용어주의)

In [48]:
import pandas as pd

pd.to_datetime(1626747238.0,unit='s')  # 파이썬의 datetime 값이 나옴. =판다스의 timestamp

Timestamp('2021-07-20 02:13:58')

In [49]:
date = pd.Timestamp(1626747238.0, unit='s',tz='Asia/Seoul')  #판다스의 Timestamp의 T는 대문자. tz는 타임젯
                                                             # tz='Asia/Seoul' 외워둘것
print(date,type(date))

2021-07-20 11:13:58+09:00 <class 'pandas._libs.tslibs.timestamps.Timestamp'>

In [51]:
df = pd.read_csv('dataset/stock-data.csv')  # 경로설정 어떻게 하는지 복습
df.head()

         Date  Close  Start   High    Low  Volume
0  2018-07-02  10100  10850  10900  10000  137977
1  2018-06-29  10700  10550  10900   9990  170253
2  2018-06-28  10400  10900  10950  10150  155769
3  2018-06-27  10900  10800  11050  10500  133548
4  2018-06-26  10800  10900  11000  10700   63039

In [53]:
df.info()  # 요약한거보기
           # date가 obj로 되어있음.

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Date    20 non-null     object
 1   Close   20 non-null     int64
 2   Start   20 non-null     int64
 3   High    20 non-null     int64
 4   Low     20 non-null     int64
 5   Volume  20 non-null     int64
dtypes: int64(5), object(1)
memory usage: 1.1+ KB

In [54]:
df['New_Date'] = pd.to_datetime(df['Date']) #새로운 컬럼 만들려면 대괄호. 
                    # 타입을 바꿔서 뉴데이트에 저장해라.
df.info()           # 6번에 새로생김

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 7 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Date      20 non-null     object
 1   Close     20 non-null     int64
 2   Start     20 non-null     int64
 3   High      20 non-null     int64
 4   Low       20 non-null     int64
 5   Volume    20 non-null     int64
 6   New_Date  20 non-null     datetime64[ns]
dtypes: datetime64[ns](1), int64(5), object(1)
memory usage: 1.2+ KB

In [ ]:
df.drop('Date', axis=1, inplace= True)  # 열방향이라 axis=1, 원본에 반영할것이므로 inplace=True.
                                        # inplace 쓰면 한번 지우면 그 데이터는 날아가기때문에
                                        # 카피데이터를 쓰거나 하는 식으로 신중하게 사용

In [56]:
df['year'] = df['New_Date'].dt.year
df['month'] = df['New_Date'].dt.month
df['day'] = df['New_Date'].dt.day
df.head()

   Close  Start   High    Low  Volume   New_Date  year  month  day
0  10100  10850  10900  10000  137977 2018-07-02  2018      7    2
1  10700  10550  10900   9990  170253 2018-06-29  2018      6   29
2  10400  10900  10950  10150  155769 2018-06-28  2018      6   28
3  10900  10800  11050  10500  133548 2018-06-27  2018      6   27
4  10800  10900  11000  10700   63039 2018-06-26  2018      6   26

In [61]:
df1 = df.copy()

In [62]:
df1.set_index('New_Date', inplace=True)  # 인덱스를 새로 설정
df1.head()                               # 뉴데이트가 인덱스로 바뀜

            Close  Start   High    Low  Volume  year  month  day
New_Date
2018-07-02  10100  10850  10900  10000  137977  2018      7    2
2018-06-29  10700  10550  10900   9990  170253  2018      6   29
2018-06-28  10400  10900  10950  10150  155769  2018      6   28
2018-06-27  10900  10800  11050  10500  133548  2018      6   27
2018-06-26  10800  10900  11000  10700   63039  2018      6   26

In [63]:
df1.index

DatetimeIndex(['2018-07-02', '2018-06-29', '2018-06-28', '2018-06-27',
               '2018-06-26', '2018-06-25', '2018-06-22', '2018-06-21',
               '2018-06-20', '2018-06-19', '2018-06-18', '2018-06-15',
               '2018-06-14', '2018-06-12', '2018-06-11', '2018-06-08',
               '2018-06-07', '2018-06-05', '2018-06-04', '2018-06-01'],
              dtype='datetime64[ns]', name='New_Date', freq=None)

In [66]:
df1_ym = df1.loc['2018-06', 'Start':'Low']  # 인덱스로 만들어줘서 2018-06 과 같이 써도 값이 나옴
df1_ym

            Start   High    Low
New_Date
2018-06-29  10550  10900   9990
2018-06-28  10900  10950  10150
2018-06-27  10800  11050  10500
2018-06-26  10900  11000  10700
2018-06-25  11400  11450  11000
2018-06-22  11250  11450  10750
2018-06-21  11350  11750  11200
2018-06-20  11200  11600  10900
2018-06-19  11850  11950  11300
2018-06-18  13400  13400  12000
2018-06-15  13600  13600  12900
2018-06-14  13200  13700  13150
2018-06-12  12200  13300  12050
2018-06-11  12000  12250  11950
2018-06-08  11950  12200  11800
2018-06-07  12200  12300  11900
2018-06-05  11800  12250  11800
2018-06-04  11900  12200  11700
2018-06-01  11800  12100  11750

In [68]:
pd.date_range(start='2020-10-01', end='2020-10-20', periods=5)  #시작~끝날짜까지 5개값을 균등한 기간으로 뱉음

DatetimeIndex(['2020-10-01 00:00:00', '2020-10-05 18:00:00',
               '2020-10-10 12:00:00', '2020-10-15 06:00:00',
               '2020-10-20 00:00:00'],
              dtype='datetime64[ns]', freq=None)

In [70]:
dates = pd.date_range('1/1/2000', periods=100, freq='W-WED') # 주단위-매주 수요일을 2000년 1월1일부터 100개값을 보여줌
print(dates)

DatetimeIndex(['2000-01-05', '2000-01-12', '2000-01-19', '2000-01-26',
               '2000-02-02', '2000-02-09', '2000-02-16', '2000-02-23',
               '2000-03-01', '2000-03-08', '2000-03-15', '2000-03-22',
               '2000-03-29', '2000-04-05', '2000-04-12', '2000-04-19',
               '2000-04-26', '2000-05-03', '2000-05-10', '2000-05-17',
               '2000-05-24', '2000-05-31', '2000-06-07', '2000-06-14',
               '2000-06-21', '2000-06-28', '2000-07-05', '2000-07-12',
               '2000-07-19', '2000-07-26', '2000-08-02', '2000-08-09',
               '2000-08-16', '2000-08-23', '2000-08-30', '2000-09-06',
               '2000-09-13', '2000-09-20', '2000-09-27', '2000-10-04',
               '2000-10-11', '2000-10-18', '2000-10-25', '2000-11-01',
               '2000-11-08', '2000-11-15', '2000-11-22', '2000-11-29',
               '2000-12-06', '2000-12-13', '2000-12-20', '2000-12-27',
               '2001-01-03', '2001-01-10', '2001-01-17', '2001-01-24',
               '2001-01-31', '2001-02-07', '2001-02-14', '2001-02-21',
               '2001-02-28', '2001-03-07', '2001-03-14', '2001-03-21',
               '2001-03-28', '2001-04-04', '2001-04-11', '2001-04-18',
               '2001-04-25', '2001-05-02', '2001-05-09', '2001-05-16',
               '2001-05-23', '2001-05-30', '2001-06-06', '2001-06-13',
               '2001-06-20', '2001-06-27', '2001-07-04', '2001-07-11',
               '2001-07-18', '2001-07-25', '2001-08-01', '2001-08-08',
               '2001-08-15', '2001-08-22', '2001-08-29', '2001-09-05',
               '2001-09-12', '2001-09-19', '2001-09-26', '2001-10-03',
               '2001-10-10', '2001-10-17', '2001-10-24', '2001-10-31',
               '2001-11-07', '2001-11-14', '2001-11-21', '2001-11-28'],
              dtype='datetime64[ns]', freq='W-WED')

In [72]:
pd.date_range('2000-01-01','2000-01-03 23:59', freq='4h') # 4시간단위로 보여줌

DatetimeIndex(['2000-01-01 00:00:00', '2000-01-01 04:00:00',
               '2000-01-01 08:00:00', '2000-01-01 12:00:00',
               '2000-01-01 16:00:00', '2000-01-01 20:00:00',
               '2000-01-02 00:00:00', '2000-01-02 04:00:00',
               '2000-01-02 08:00:00', '2000-01-02 12:00:00',
               '2000-01-02 16:00:00', '2000-01-02 20:00:00',
               '2000-01-03 00:00:00', '2000-01-03 04:00:00',
               '2000-01-03 08:00:00', '2000-01-03 12:00:00',
               '2000-01-03 16:00:00', '2000-01-03 20:00:00'],
              dtype='datetime64[ns]', freq='4H')

In [2]:
import pandas as pd
df = pd.read_csv('dataset/stock-data.csv') #괄호안에 들어가는 원칙은 ('./dataset/stock-data.csv')
df.head()                                  # .은 현재를 말함.이 컴퓨터는 지금 pandas가 기본
                                           # 상대경로

         Date  Close  Start   High    Low  Volume
0  2018-07-02  10100  10850  10900  10000  137977
1  2018-06-29  10700  10550  10900   9990  170253
2  2018-06-28  10400  10900  10950  10150  155769
3  2018-06-27  10900  10800  11050  10500  133548
4  2018-06-26  10800  10900  11000  10700   63039

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Date    20 non-null     object
 1   Close   20 non-null     int64
 2   Start   20 non-null     int64
 3   High    20 non-null     int64
 4   Low     20 non-null     int64
 5   Volume  20 non-null     int64
dtypes: int64(5), object(1)
memory usage: 1.1+ KB

In [5]:
# new_Date 열 만들기
df['new_Date'] = pd.to_datetime(df.Date) # datetime형식으로 바꿈
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 7 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Date      20 non-null     object
 1   Close     20 non-null     int64
 2   Start     20 non-null     int64
 3   High      20 non-null     int64
 4   Low       20 non-null     int64
 5   Volume    20 non-null     int64
 6   new_Date  20 non-null     datetime64[ns]
dtypes: datetime64[ns](1), int64(5), object(1)
memory usage: 1.2+ KB

In [6]:
# 날짜 인덱스
df1 = df.copy()
df1.set_index('new_Date', inplace=True)
df1.drop('Date', axis=1, inplace = True)
df1.head()

            Close  Start   High    Low  Volume
new_Date
2018-07-02  10100  10850  10900  10000  137977
2018-06-29  10700  10550  10900   9990  170253
2018-06-28  10400  10900  10950  10150  155769
2018-06-27  10900  10800  11050  10500  133548
2018-06-26  10800  10900  11000  10700   63039

- 인덱스 리셋

In [8]:
df1 = df1.reset_index()  # new_Date를 다시 컬럼으로 보내기
df1.head()

    new_Date  Close  Start   High    Low  Volume
0 2018-07-02  10100  10850  10900  10000  137977
1 2018-06-29  10700  10550  10900   9990  170253
2 2018-06-28  10400  10900  10950  10150  155769
3 2018-06-27  10900  10800  11050  10500  133548
4 2018-06-26  10800  10900  11000  10700   63039